src/cf/Catalogs/CRM_Виджеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_Виджеты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ШаблоныКлючевыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/CRM_НастройкиВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_НастройкиВиджетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодОбновления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАналитики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыРазверткиПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеАналитики</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_ТипыАналитикПоказателей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Виджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Виджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексВиджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/CRM_ТипыПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ТипыПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Динамика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Результативность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/CRM_ВидыРазверткиПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ВидыРазверткиПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Показатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Источник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аналитика1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аналитика2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аналитика3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/CRM_Виджеты/Forms/Виджеты/Ext/Form/Module.bsl
#Область ОбщиеПроцедурыИФункцииФормы

&НаСервере
Функция ПолучитьПериодОбновленияВиджетаНаСервере(Виджет, Индекс)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкиВиджетов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь 	= ТекущийПользователь;
	МенеджерЗаписи.Виджет 			= Виджет;
	МенеджерЗаписи.ИндексВиджета 	= Индекс;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.ПериодОбновления;
	Иначе
		Возврат Виджет.ИсточникДанных.ПериодОбновления;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ДобавитьВиджетЗавершениеНаСервере(Виджет)
	
	Если Виджет = Неопределено ИЛИ (Виджет.ИсточникДанных.ТипПоказателя = Перечисления.CRM_ТипыПоказателей.Динамика И НЕ ЗначениеЗаполнено(Виджет.ИсточникДанных.ПлановыйПоказатель)) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексВиджета = Формат(СписокВиджетовПользователя.Количество()+1, "ЧЦ=2; ЧДЦ=; ЧВН=");
	НовыйЭлемент = СписокВиджетовПользователя.Добавить(Виджет, ИндексВиджета);
	CRM_РаботаСВиджетамиВызовСервера.ЗаполнитьВиджетыТекущихДел(ЭтотОбъект);
	КоличествоВиджетовНаФорме = СписокВиджетовПользователя.Количество();
	
	CRM_ХранилищеНастроек.Сохранить(ЭтотОбъект.ИмяФормы, "ВиджетыПользователя", СписокВиджетовПользователя);
	
	// Записать в регистр настройки нового виджета по умолчанию.
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкиВиджетов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь 		= ТекущийПользователь;
	МенеджерЗаписи.Виджет 				= Виджет;
	МенеджерЗаписи.ИндексВиджета 		= ИндексВиджета;
	МенеджерЗаписи.ПериодОбновления 	= Виджет.ИсточникДанных.ПериодОбновления;
	МенеджерЗаписи.ТипАналитики 		= Перечисления.CRM_ВидыРазверткиПоказателей.Аналитика1;
	МенеджерЗаписи.ЗначениеАналитики 	= ТекущийПользователь;
	МенеджерЗаписи.Записать();
	
	Возврат Новый Структура("Виджет, ИндексВиджета, ПериодОбновленияВиджета", Виджет, ИндексВиджета, Виджет.ИсточникДанных.ПериодОбновления);
	
КонецФункции

// Открывает форму настройки виджета формы.
//
// Параметры:
//   Форма - УправляемаяФорма - форма Текущие дела.
//   ИндексВиджета - Строка - индекс настраиваемого виджета в форме.
//
&НаСервере
Процедура УдалитьВиджетФормы(ИндексВиджета)
	
	тЭлемент = CRM_РаботаСВиджетамиКлиентСервер.ПолучитьЭлементСпискаЗначенийПоИндексу(СписокВиджетовПользователя, ИндексВиджета);
	
	Если тЭлемент <> Неопределено Тогда
		// Удаляем из регистра запись с настройками текущего виджета.
		МенеджерЗаписи = РегистрыСведений.CRM_НастройкиВиджетов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь 		= ТекущийПользователь;
		МенеджерЗаписи.Виджет 				= тЭлемент.Значение;
		МенеджерЗаписи.ИндексВиджета 		= ИндексВиджета;
		МенеджерЗаписи.Удалить();
		
		СписокВиджетовПользователя.Удалить(тЭлемент);
		
		// Пересчет порядковых номеров.
		Для Сч = 1 По СписокВиджетовПользователя.Количество() Цикл
			СписокВиджетовПользователя[Сч-1].Представление = Формат(Сч, "ЧЦ=2; ЧДЦ=; ЧВН=");
		КонецЦикла;
		
		CRM_РаботаСВиджетамиВызовСервера.ЗаполнитьВиджетыТекущихДел(ЭтотОбъект);
		КоличествоВиджетовНаФорме = СписокВиджетовПользователя.Количество();
		
		CRM_ХранилищеНастроек.Сохранить(ЭтотОбъект.ИмяФормы, "ВиджетыПользователя", СписокВиджетовПользователя);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает индекс текущего виджета по выделенному элементу форму.
// Если по выделенному элементу невозможно определить индекс виджета, то
// возвращается пустая строка.
//
&НаКлиенте
Функция ИндексТекущегоВиджета()
	
	Если ТипЗнч(ТекущийЭлемент) <> Тип("ПолеФормы")
		И ТипЗнч(ТекущийЭлемент) <> Тип("ДекорацияФормы") Тогда
		
		Возврат "";
	КонецЕсли;
	
	ИндексТекущегоВиджета = Прав(ТекущийЭлемент.Имя,2);
	
	Возврат ИндексТекущегоВиджета;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	СписокВиджетовПользователя = CRM_ХранилищеНастроек.Загрузить(ЭтотОбъект.ИмяФормы, "ВиджетыПользователя");
	КоличествоВиджетовНаФорме = СписокВиджетовПользователя.Количество();
	CRM_РаботаСВиджетамиВызовСервера.ЗаполнитьВиджетыТекущихДел(ЭтотОбъект, "", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого ЭлементСписка Из СписокВиджетовПользователя Цикл
		Если Число(ЭлементСписка.Представление) <= 4 Тогда
			ПериодОбновленияВиджета = ПолучитьПериодОбновленияВиджетаНаСервере(ЭлементСписка.Значение, ЭлементСписка.Представление);
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ЭлементСписка.Представление, ПериодОбновленияВиджета);
		ИначеЕсли Число(ЭлементСписка.Представление) = 5 Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие", 3600);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьВиджеты" Тогда
		CRM_РаботаСВиджетамиВызовСервера.ЗаполнитьВиджетыТекущихДел(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИндексВиджета = ИндексТекущегоВиджета();
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "УдалитьВиджет") Тогда
		УдалитьВиджетФормы(ИндексВиджета);
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "ОткрытьПоказатель") Тогда
		тЭлемент = CRM_РаботаСВиджетамиКлиентСервер.ПолучитьЭлементСпискаЗначенийПоИндексу(СписокВиджетовПользователя, ИндексВиджета);
		Если тЭлемент <> Неопределено Тогда
			ПоказатьЗначение( ,тЭлемент.Значение);
		КонецЕсли;
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "НастройкаВиджета") Тогда
		тЭлемент = CRM_РаботаСВиджетамиКлиентСервер.ПолучитьЭлементСпискаЗначенийПоИндексу(СписокВиджетовПользователя, ИндексВиджета);
		Если тЭлемент <> Неопределено Тогда
			ОповещениеНастройкаВиджета = Новый ОписаниеОповещения("НастройкаВиджетаЗавершение", ЭтотОбъект, Новый Структура("Индекс", ИндексВиджета));
			ПараметрыФормы = Новый Структура("Виджет, ИндексВиджета", тЭлемент.Значение, тЭлемент.Представление);
			ОткрытьФорму("Справочник.CRM_Виджеты.Форма.ФормаНастройки", ПараметрыФормы, ЭтотОбъект, , , , ОповещениеНастройкаВиджета, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "РасшифроватьЗначение") Тогда
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Href) И СтрЗаканчиваетсяНа(ДанныеСобытия.Href, "Обновить") Тогда
		ОбновитьВиджетыНаСервере();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДобавитьНовыйВиджетНажатие(Элемент)
	Если КоличествоВиджетовНаФорме = 99 Тогда
		Возврат;
	КонецЕсли;
		
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ДобавитьВиджетЗавершение", ЭтотОбъект);
	
	//ПараметрыФормы = Новый Структура("Виджеты, СписокОткрытыхВиджетов", Истина, СписокВиджетовПользователя.ВыгрузитьЗначения());
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФормаВиджеты", Истина);
	ОткрытьФорму("Справочник.CRM_Виджеты.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеПроцедурыФормы

&НаКлиенте
Процедура ДобавитьВиджетЗавершение(Виджет, ДополнительныеПараметры) Экспорт
	
	ДанныеВиджета = ДобавитьВиджетЗавершениеНаСервере(Виджет);
	
	Если ДанныеВиджета <> Неопределено Тогда
		Если Число(ДанныеВиджета.ИндексВиджета) <= 4 Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ДанныеВиджета.ИндексВиджета, ДанныеВиджета.ПериодОбновленияВиджета);
		ИначеЕсли Число(ДанныеВиджета.ИндексВиджета) = 5 Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_Прочие", 3600);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВиджетаЗавершение(НовыеНастройки, ДополнительныеПараметры) Экспорт
	
	Если НовыеНастройки <> Неопределено Тогда
		Если НовыеНастройки = Ложь Тогда
			УдалитьВиджетФормы(ДополнительныеПараметры.Индекс);
			Возврат;
		КонецЕсли;
		ОбновитьВиджетНаСервере(ДополнительныеПараметры.Индекс);
		Если Число(ДополнительныеПараметры.Индекс) <= 4 Тогда
			ОтключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ДополнительныеПараметры.Индекс);
			ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВиджет_" + ДополнительныеПараметры.Индекс, НовыеНастройки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеВиджетов

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_01()
	ОбновитьВиджетНаСервере("01");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_02()
	ОбновитьВиджетНаСервере("02");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_03()
	ОбновитьВиджетНаСервере("03");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_04()
	ОбновитьВиджетНаСервере("04");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВиджет_Прочие()
	ОбновитьВиджетНаСервере("Прочие");
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетНаСервере(ИндексВиджета)
	CRM_РаботаСВиджетамиВызовСервера.ОбновитьТекущийВиджет(ЭтотОбъект, ИндексВиджета);
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиджетыНаСервере()
	CRM_РаботаСВиджетамиВызовСервера.ЗаполнитьВиджетыТекущихДел(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
